Revit 2026 API

# ExporterIFCGetHostObjects Method

---

Returns a collection containing the host object handles in the document.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<IDictionary<ElementId, IFCAnyHandle>> GetHostObjects()
```
```vb
Public Function GetHostObjects As IList(Of IDictionary(Of ElementId, IFCAnyHandle))
```
```cpp
public:
IList<IDictionary<ElementId^, IFCAnyHandle^>^>^ GetHostObjects()
```
```fsharp
member GetHostObjects : unit -> IList<IDictionary<ElementId, IFCAnyHandle>>
```

#### Return Value

IListIDictionaryElementId, IFCAnyHandle The collection of host objects.

Host object handles is currently collected by RegisterSpaceBoundingElementHandle and exporting internal element and cached in the ExporterIFC object. This method returns the cached information which is needed to create wall connectivity objects.

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace